feat: add .dockerignore. update architecture diagram in  README.md
